In [7]:
import pandas as pd
technologies={
    'courses':["python","dbms","java","python","spark"],
    'fee':[20000,25000,26000,27000,24000],
    'duration':['30days','40days','35days','60days','30days'],
    'discount':[1000,2300,1200,2500,2000]
}
df=pd.DataFrame(technologies)
print(df)

  courses    fee duration  discount
0  python  20000   30days      1000
1    dbms  25000   40days      2300
2    java  26000   35days      1200
3  python  27000   60days      2500
4   spark  24000   30days      2000

In [8]:
df.groupby('courses').aggregate({'duration':'count','fee':['first','last']})

        duration    fee
           count  first   last
courses
dbms           1  25000  25000
java           1  26000  26000
python         2  20000  27000
spark          1  24000  24000

In [10]:
df.groupby('courses').aggregate({'fee':'count'})

         fee
courses
dbms       1
java       1
python     2
spark      1